# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+TITLE: Faust 101
#+AUTHOR: Thomas Rushton

#+OPTIONS: num:nil toc:nil reveal_width:1200 reveal_height:800 ^:{} ':t
#+EXPORT_FILE_NAME: index
#+PROPERTY: header-args:faust :line-numbers false
#+PROPERTY: header-args:css :tangle yes :results none :exports none
#+PROPERTY: header-args:js :tangle yes :results none :exports none
#+REVEAL_ROOT: ../reveal.js
#+REVEAL_THEME: white
#+REVEAL_PLUGINS: (math)
#+REVEAL_EXTRA_CSS: ccrma-2024.css
#+REVEAL_MIN_SCALE: 1.0
#+REVEAL_MAX_SCALE: 1.0
#+REVEAL_EXTRA_OPTIONS: hash: true, fragmentInURL: true
#+REVEAL_EXTRA_SCRIPTS: ("dist/ccrma.js")
#+REVEAL_TITLE_SLIDE: <h1>%t</h1><h2>%s</h2><h3>%a</h3>

** Add a UI

#+begin_src faust :results html :exports results :tab ui :sizes 50,50
process = hslider("gain", 0.5, 0, 1, .01),_ : *;
#+end_src

#+RESULTS:
#+begin_export html
<div class="faust-editor-wrap">
<faust-editor sizes="[50,50]" tab="ui" lineNumbers="false">
<!--
process = hslider("gain", 0.5, 0, 1, .01),_ : *;
-->
</faust-editor>
</div>
#+end_export

** Use the Faust Libraries

#+begin_src faust :results html :exports results :tab ui :sizes 50,50
import("stdfaust.lib");
process = no.noise,hslider("gain", 0.1, 0, 1, .01) : *;
#+end_src

#+RESULTS:
#+begin_export html
<div class="faust-editor-wrap">
<faust-editor sizes="[50,50]" tab="ui" lineNumbers="false">
<!--
import("stdfaust.lib");
process = no.noise,hslider("gain", 0.1, 0, 1, .01) : *;
-->
</faust-editor>
</div>
#+end_export

** Iterate

#+begin_src faust :results html :exports results :tab ui :sizes 50,50
import("stdfaust.lib");
N = 3;
freq = hslider("freq", 200, 100, 300, .01);
process = sum(i, N, os.osc((i + 1) * freq)) / N;
#+end_src

#+RESULTS:
#+begin_export html
<div class="faust-editor-wrap">
<faust-editor sizes="[50,50]" tab="ui" lineNumbers="false">
<!--
import("stdfaust.lib");
N = 3;
freq = hslider("freq", 200, 100, 300, .01);
process = sum(i, N, os.osc((i + 1) * freq)) / N;
-->
</faust-editor>
</div>
#+end_export

